package exam03;

public class Sample01 {

	public static void main(String[] args) {
		/*
		 * 변수(Variable) : 값을 저장하기 위한 공간(이름공간 - namespace)
		 * 공간에 저장된 값은 언제든지 바뀔 수 있다.
		 * 사람 입장에서 값은 정수, 실수, 문자열 등의 값을 지칭을 함.
		 * 기계 입장에서 값은 01010(2진수 값)이다.
		 * 
		 * 저장된 값은 필요하면 언제든 재사용 할 수 있다.
		 * 
		 */
		
		/*
		 * 변수 선언 형식
		 * 		자료형 변수명;
		 * 
		 * 변수 선언 후 값을 지정하는 형식 
		 * 		자료형 변수명 = 값;
		 * 
		 * 변수 선언 후 나중에 값을 지정하는 형식
		 * 		자료형 변수명;
		 * 		변수명 = 값;
		 * 
		 */
		
		int n1;
		
		int n2 = 1;
		
		int n3;
		n3 = 2;
		
		/*
		 * 자료형 : 변수 공간에 저장할 값의 종류를 지정하기 위해 사용한다.
		 * 	boolean : 참, 거짓에 해당하는 논리값 -> true/false
		 * 	char : 문자값, 문자 값을 저장할 때 반드시 '' 사용
		 * 	String : 문자열 값, 문자열 값을 저장할 때는 "" 사용
		 * 	byte 
		 * 
		 */
		
	}

}
