package exam01;

public class Sample01 {

	public static void main(String[] args) {
		/*
		 * 입출력(IO, Input/ Output)
		 * 	- 컴퓨터 내부/ 외부 장치와 데이터를 주고 받는 것
		 * 	- 프로그램을 기준으로 외부 장치에서 데이터가 현재 동작하는 프로그램으로 들어오면 입력
		 * 	 외부 장치로 데이터를 보내면 출력
		 * 
		 * 스트림(Stream) : 데이터를 계속 보내주는 것
		 * 	- 입력스트림, 출력스트림으로 나누어서 불린다. 
		 * 	- 두 장치간에 데이터를 지속적으로 입/출력하기 위해 생성된 연결 통로
		 * 	- 단방향 통신을 지원하기 때문에 입력/출력을 동시에 할 수 없다.
		 * 	  동시에 하기 위해서 입력 스트림, 출력 스트림을 개별적으로 만든다.
		 * 	- 스트림을 통해 데이터를 주고 받을 때 문자기반 스트림과 바이트 기반 스트림으로 
		 * 	  분리된다.
		 * 	- 문자기반스트림의 경우 일반 텍스트 문서를 전송하기 위해 사용한다. (한글, 워드는 일반 텍스트 문서 X)
		 *	  바이트기반 스트림, 문자기반 스트림 어떤 걸 사용해야할지 모르겠다면 아래 구별법 사용하기
		 *	  txt확장자를 사용 -> 어떤 프로그램을 연결프로그램 
		 *	  -> 메모장으로 열었는데 도대체 뭐가 있는 모르겠다 싶으면(외계어) 바이트 스트림으로 해야 함
		 * 	  (네트워크 통신 할 때 -> 바이트 기반 , 우리가 만들 때 -> 문자 기반)
		 */
		
		

	}

}
